.. _abn_userguide:

ABN Strings
============

Introduction
------------

The function :func:`clean_no_mva() <dataprep.clean.clean_no_mva.clean_no_mva>` cleans a column containing Norwegian VAT number (ABN) strings, and standardizes them in a given format. The function :func:`validate_no_mva() <dataprep.clean.clean_no_mva.validate_no_mva>` validates either a single ABN strings, a column of ABN strings or a DataFrame of ABN strings, returning `True` if the value is valid, and `False` otherwise.

ABN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "995525828MVA"
* `standard`: ABN strings with proper whitespace in the proper places, like "NO 995 525 828 MVA"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_no_mva()` and `validate_no_mva()`.

### An example dataset containing ABN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "abn": [
            "995525828MVA",
            "NO 995 525 829 MVA",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                  abn                                           address
0        995525828MVA                                     123 Pine Ave.
1  NO 995 525 829 MVA                                           main st
2         51824753556                      1234 west main heights 57033
3      51 824 753 556                    apt 1 789 s maple rd manhattan
4               hello                robie house, 789 north main street
5                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                NULL                                             hello

## 1. Default `clean_no_mva`

By default, `clean_no_mva` will clean abn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_no_mva
clean_no_mva(df, column = "abn")

,abn,address,abn_clean
0,995525828MVA,123 Pine Ave.,NO 995 525 828 MVA
1,NO 995 525 829 MVA,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_no_mva(df, column = "abn", output_format="standard")

,abn,address,abn_clean
0,995525828MVA,123 Pine Ave.,NO 995 525 828 MVA
1,NO 995 525 829 MVA,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_no_mva(df, column = "abn", output_format="compact")

,abn,address,abn_clean
0,995525828MVA,123 Pine Ave.,995525828MVA
1,NO 995 525 829 MVA,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned ABN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_no_mva(df, column="abn", inplace=True)

            abn_clean                                           address
0  NO 995 525 828 MVA                                     123 Pine Ave.
1                 NaN                                           main st
2                 NaN                      1234 west main heights 57033
3                 NaN                    apt 1 789 s maple rd manhattan
4                 NaN                robie house, 789 north main street
5                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                 NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_no_mva(df, "abn", errors="coerce")

,abn,address,abn_clean
0,995525828MVA,123 Pine Ave.,NO 995 525 828 MVA
1,NO 995 525 829 MVA,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_no_mva(df, "abn", errors="ignore")

,abn,address,abn_clean
0,995525828MVA,123 Pine Ave.,NO 995 525 828 MVA
1,NO 995 525 829 MVA,main st,NO 995 525 829 MVA
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_no_mva()`

`validate_no_mva()` returns `True` when the input is a valid ABN. Otherwise it returns `False`.

The input of `validate_no_mva()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_no_mva()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_no_mva()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_no_mva
print(validate_no_mva("995525828MVA"))
print(validate_no_mva("NO 995 525 829 MVA"))
print(validate_no_mva("51824753556"))
print(validate_no_mva("51 824 753 556"))
print(validate_no_mva("hello"))
print(validate_no_mva(np.nan))
print(validate_no_mva("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_no_mva(df["abn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: abn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_no_mva(df, column="abn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: abn, dtype: bool

### Only DataFrame

In [11]:
validate_no_mva(df)

     abn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False